y1s1/cy1001-cell/macromolecules/notes.org
#+TITLE: Macromolecules Notes
#+AUTHOR: Hankertrix
#+STARTUP: showeverything
#+OPTIONS: toc:2
#+LATEX_HEADER: \usepackage{gensymb, siunitx}

\newpage

* Definitions

** Monosaccharides
Monosaccharides are made up of 3 to 8 carbon atoms and have either an aldehyde \((CHO)\) or ketone \((C=O)\) functional group. The hydroxyl \((OH)\) functional groups are distributed across the carbon backbone.

** Trioses
Trioses are monosaccharides which consists of 3 carbon atoms. An example of a triose is glyceraldehyde, which plays a significant role in many metabolic pathways.

** Pentoses
Pentoses are monosaccharides which consists of 5 carbon atoms. There are two pentoses called ribose and deoxyribose that are commonly found in biological systems. Ribose has a hydroxyl group on the $2^{nd}$ carbon atom while deoxyribose has only hydrogen.

** Hexoses
Hexoses are monosaccharides which consists of 6 carbon atoms. Hexoses are the most common monosaccharide. An example of a hexose is glucose.

** Disaccharides
Disaccharides are dimers of 2 monosaccharides that are linked through a covalent bond. A few examples include maltose, which is found in beer, lactose, which is found in milk, and sucrose, which is table sugar.
\\

The most common covalent bond is found between carbon-1 of one monosaccharide unit and the carbon-4 of another. The bond is referred to as a glycosidic bond. The position of the linked carbon on the second monosaccharide may differ, but the most common is carbon-4.
\\

Making and breaking of glycosidic bonds involved the release of one water molecule, so it is a condensation reaction.

** Maltose
When two molecules of glucose come together through the formation of an \(\alpha\)(1-4) glycosidic bond, the product is the disaccharide maltose. The linkage is called an \(\alpha\)(1-4) glycosidic bond, because it is formed between the carbon-1 of the first glucose and the carbon-4 of the second glucose, when the first glucose unit is in its $\alpha$ form. Thereafter, the formation of the glycosidic bond results in the first glucose unit being locked in the $\alpha$ form.

** Lactose
The disaccharide lactose is found in abundance in milk. When \(\beta\)-galactose is linked with glucose by a (1-4) glycosidic linkage, lactose is formed. The linkage is called \(\beta\)(1-4) glycosidic linkage because it is formed when the galactose unit is locked in its $\beta$ form.

** Sucrose
The disaccharide sucrose, the glucose molecule in its $\alpha$ form is joined to a \(\beta\)-fructose molecule by a less common \((\alpha 1 \text{ - } \beta 2)\) glycosidic linkage, rather than the "1-4" type of linkage that we see with lactose or maltose.

** Polysaccharides
Polysaccharides are formed when several monosaccharides are connected covalently to form a polymer. Starch, cellulose, glycogen and chitin are a few naturally occurring polysaccharides. Starch and cellulose are both polymers of glucose. Polysaccharides do not have a defined 3D structure and are insoluble in water.

** Plant starch
Plant starch exists in two forms, amylose and amylopectin. When glucose units are joined by an \(\alpha\)(1-4) glycosidic linkage, it gives rise to a long linear polysaccharide called amylose. The polysaccharides can also form branches, and one of the common branches in polysaccharides is formed by an \(\alpha\)(1-6) glycosidic linkage. Since polysaccharides are insoluble in water, starch is found as granules within the cell. Amylopectin in particular has 24 to 30 glucose subunits that separate branch points along the amylopectin chains.

** Animal starch
Animal starch is called glycogen, and it is stored in liver cells (hepatocytes) and muscles. It is converted into glucose when energy is required.

** Glycogen
Glycogen is a multi-branched polymer of glucose that has more densely branched polysaccharide chains and is packaged together with a protein, glycogenin, in its core. Glycogen is better than both amylose and amylopectin and is hence insoluble in water which means that it exists as granules in animal cells.
\\

Polysaccharide chains in glycogen are formed by glucose subunits and are joined \(\alpha\)(1-4) glycosidic bonds, and branched points are mediated by \(\alpha\)(1-6) glycosidic bonds. 7 to 11 glucose subunits in glycogen separate branch points along the glycogen chains.

** Cellulose
Cellulose is found in plant cells and is a major component of plant cell walls. Cellulose is a long unbranched polymer of glucose linked by \(\beta\)(1-4) glycosidic bonds, which allows it to form strong and long-lasting fibres as most organisms do not have the enzyme to break the \(\beta\)(1-4) bonds of cellulose. Some herbivorous animals have the enzymes to break the \(\beta\)(1-4) bonds of cellulose and hence are able to use cellulose as an energy-rich food source.

** Chitin
Chitin is a special type of polysaccharide that is found in the cell walls of fungi and the exoskeletons of insects, crustaceans, and molluscs. Chitin is polymer of N-acetylglucosamine, which is a glucose derivative, with \(\beta\)(1-4) glycosidic linkages. Glucosamine is similar to \(\beta\)-glucose, but amino group replaces the hydroxyl group at carbon-2. In N-acetylglucosamine, the amino group of glucosamine is bonded to an acetyl group.
\\

Although chitin is similar to cellulose, chitin is stronger due to the increased number of hydrogen bonding between chains. Chitin is also often complexed with other components, such as a protein or calcium carbonate, which would change the physical properties of the resulting molecule.

** Deoxyribonucleic acid (DNA)
Deoxyribonucleic acid (DNA) is the genetic blueprints of all free-living organisms and play major roles in heredity by encoding genes that define the characteristics and activities of an organism. DNA is a linear polymer made up of building blocks called nucleotides, and it exists as a double-stranded molecule. There are 4 types of nucleotides that make up DNA, which are A, G, C, and T. DNA contains the sugar deoxyribose.

** Ribonucleic acids (RNA)
Ribonucleic acids (RNA) serve as the messenger units which transfer information from the master DNA blueprint to make proteins during gene expression. RNA is a linear polymer made up of building blocks called nucleotides, and it exists as a single-stranded molecule. There are 4 types of nucleotides that make up RNA, which are A, G, C, and U. RNA contains the sugar ribose. RNA often exists as a single-stranded molecule, although it forms some double-stranded regions in its secondary structure.

** Nucleotides
The monomeric units of nucleic acids are known as nucleotides, which have 3 components:
- Nitrogen-containing base
- Sugar (pentose)
- At least one phosphate

** Nucleoside
Nucleoside is the base bonded to ribose or deoxyribose. The ribose derivative is called adenosine while the deoxyribose derivative is called deoxyadenosine.

** Nucleotide
Nucleotide is the base bonded to ribose or deoxyribose and phosphate(s). The ribose derivative is called adenosine monophosphate while the deoxyribose derivative is called deoxyadenosine monophosphate.

** mRNA
Messenger RNA (mRNA) copies and carries information from DNA to the ribosome.

