y1s1/cy1001-cell/macromolecules/notes.tex
\subsection{rRNA}
\label{sec:orgfee7d0c}
Ribosomal RNA (rRNA) has complex secondary structures with multiple double-stranded regions formed within a single rRNA chain. rRNA combines with proteins to form the structure of ribosome and some rRNA also catalyses biochemical reactions.
\subsection{tRNA}
\label{sec:org39927cd}
Transfer RNA (tRNA) carries specific amino acids to the ribosome and matches it to the information on mRNA so that a "correct" protein can be assembled.
\subsection{Viral RNA}
\label{sec:org3431704}
Viruses have either DNA or RNA as their genetic material. Some viruses, including human viruses such as the Human Immunodeficiency Virus (HIV), influenza viruses, and SARS viruses, have RNA genomes.
\subsection{Ribozyme}
\label{sec:org951c254}
RNA can act as an enzyme, which is a biological catalyst. Most naturally occurring RNA catalysts participate in reactions of RNA metabolism. For example, rRNA catalyses the formation of peptide bonds during protein synthesis. Another example is the Hammerhead ribozyme which catalyses the replication of certain RNAs.

\newpage
\subsection{Amino acids}
\label{sec:org607de38}
Amino acids are the building blocks of proteins. An amino acid consists of a central carbon atom called the \(\alpha\)-carbon, that is linked to four chemical groups. They are:
\begin{itemize}
\item An amino group. \((-NH_2)\)
\item A carboxyl group. \((-COOH)\)
\item A hydrogen atom. \((H)\)
\item An R group, which is unique for all amino acids, and also called residues.
\end{itemize}

Amino acids also do not exist in an uncharged form in solution, as the carboxyl group and amino groups will be in their protonated states (with \(H^+\)), or their deprotonated states (\(H^+\) removed) depending on the pH of the solution and the \(pK_a\) values of the two groups. The uncharged amino acid reflects the amino group in the deprotonated state and the carboxyl group in the protonated state. The amino acid will be charged when the amino group is protonated and the carboxyl group is deprotonated. This charged state is called a "zwitterion" and it happens at a pH of 7.


A specific amino acid is recognised based on its unique R group structure. The names of amino acids can be abbreviated as 3-letters or as a single letter. For example, Glycine is abbreviated as Gly or G. Only \textbf{22} amino acids are known to be incorporated into proteins in living things.
\subsection{Polypeptide}
\label{sec:orgb9fb1b0}
A polypeptide is a linear chain of many amino acids with peptide bonds between consecutive amino acids. When the number of amino acids in the chain is below 10, the chain can be called a "peptide chain" or oligopeptide. A polypeptide may have tens to thousands of amino acid residues. A peptide chain with 6 amino acids is called a hexapeptide.

\newpage
\subsection{Proteins}
\label{sec:org34426ca}
Proteins are molecules that carry out most of the activities of a living thing. They carry out functions such as:
\begin{itemize}
\item Transporting material: Haemoglobin transports oxygen and carbon dioxide in our blood.
\item Immune response: Antibodies help fight diseases when we are sick.
\item Digestion: Digestive enzymes break down the food we have ingested.
\end{itemize}

They are linear polymers of amino acids, which are formed when two amino acids undergo a condensation reaction between the carboxyl group of one amino acid and the amino group of another amino acid. The resulting bond is called a peptide bond and the resulting compound from the reaction is a dipeptide. The free carboxyl and amino groups of the dipeptide can be used to form more peptide bonds with other amino acids.


Essentially, they are polypeptides which have been folded properly into its functional form. Sometimes, more than one chain of polypeptide is required to form a functional protein, so a protein may be composed of a single polypeptide or several polypeptides.
\subsection{Haemoglobin}
\label{sec:org1fbcad8}
Haemoglobin is a carrier of oxygen found in the blood, and it has four polypeptides giving rise to 4 subunits - two \(\alpha\) and two \(\beta\) subunits. The \(\alpha\) and \(\beta\) subunits are similar but not identical to each other. All the subunits have the same fold with 8 \(\alpha\)-helices, each containing a haeme group with an iron atom at its centre.

\newpage
\subsection{Lipids}
\label{sec:org558463b}
Lipids comprises a large group of diverse biological molecules in terms of structure and function. Examples include:
\begin{itemize}
\item Fats
\item Oils
\item Vitamins
\item Hormones
\item Cholesterol
\end{itemize}

Lipids are all insoluble in water due to having high levels of the hydrophobic atoms, carbon and hydrogen, in their structure while having low levels of polar atoms such as oxygen and nitrogen.
\subsection{Triglyceride}
\label{sec:org23ee649}
Triglycerides are the most common form of lipids. They are the most abundant lipids in animals and are also the major dietary lipids we ingest from animals and plants. Fats and oils are triglycerides. A triglyceride is also called triacylglycerol or triacylglyceride (TAG). A triglyceride has two parts, a glycerol molecule whose hydroxyl groups are linked through ester bonds with the carboxyl groups of three fatty acids which may be the same, or different.


Triglycerides are insoluble in aqueous medium and hence they aggregate into fat droplets within the aqueous environment of animal cells. Cells carrying such fat aggregates are called adipocytes or adipose cells. The fatty acids of triglycerides in animals serve as a major and efficient form of energy storage, because of the high number of \(C - H\) bonds. Fats therefore serve well as a form of energy storage, as an alternative to carbohydrates.
\subsection{Fatty acid}
\label{sec:org80e7272}
Fatty acid consists of a linear hydrocarbon chain with an acidic group at one end. This acidic group is a carboxyl group. The length of the hydrocarbon chain is variable. There are over 100 fatty acids known to occur naturally and the most common ones in biological systems have an even number ranging from 14 to 20 carbon atoms.
\subsection{Saturated fatty acids}
\label{sec:org17eaa5a}
Saturated fatty acids just means that the carbon atoms of the chain are linked to the maximum number of hydrogen atoms possible, which means all the bonds between the carbons atoms will be single bonds. Palmitic acid is an example of a saturated fatty acid.
\subsection{Unsaturated fatty acids}
\label{sec:orga51d0cf}
Unsaturated fatty acids just means that there is still room to attach more hydrogen atoms to the carbon backbone, which means that some of the carbon atoms are linked with double bonds. \(\alpha\)-linolenic acid is an example of an unsaturated fatty acid.
\subsection{Phospholipids}
\label{sec:orgc84d7f8}
Phospholipids are also called glycerophospholipids are formed when two of the hydroxyl groups of glycerol are linked to fatty acids through ester bonds and the third hydroxyl group is linked to a phosphate group through a phospho-ester bond, modifying the glycerol backbone to glycerol 3-phosphate. This backbone further binds with a head group substituent "X". The simplest form of "X" is a hydrogen atom. This form the most basic phospholipid, phosphatidic acid.


The other members of the glyverophospholipid family are formed when \(H\) is replaced by other polar groups like choline. The head group is then referred to as phosphocholine and the lipid is called phosphatidylcholine. Phosphatidylcholine is one of the most common phospholipids. Two other common phospholipids are phosphatidylserine and phosphatidylinositol, where the X is replaced with serine and inositol respectively. In phosphatidylserine and phosphatidylinositol, the 2 fatty acyl-chain like structures are abbreviated as \(R1\) and \(R2\). It is a standard convention unless specified.
\subsection{Cardiolipin}
\label{sec:orge282423}
Cardiolipin contains two phosphatidic acid molecules and does not have a typical phospholipid structure. Cardiolipin has a glycerol backbone which has the first and third carbons each attaching to a phosphatidic acid component. Cardiolipin is found in the inner membrane of mitochondria in both animals and plants. It is called cardiolipin because it was first discovered in the heart.
