y1s1/cy1001-cell/macromolecules/notes.org
** Sphingolipids
Sphingolipids refers to lipids with the sphingosine structure as their backbone. When the C1 of the sphingosine backbone is linked with a head group substituent X, and the amino group is linked to a fatty acid, a sphingolipid is formed. Ceramide is the simplest form of sphingolipid with the head group of H. Sphingomyelin is formed when X is replaced with phosphocholine, and it is an important lipid found in the myelin sheath of nerve cells.

** Glycolipids
Glycolipids are lipids that contain sugar groups, and many sphingolipids can also be classified as glycolipids based on this definition. Glycolipid is formed when one or more sugar molecules are connected to C3 of the glycerol backbone and constitue the polar head group. Digalactosyl-Diacylglycerol (DGDG), a major lipid of plant membranes, has two galactose molecules connected to the glycerol backbone at C3 of diacylglycerol.

** Cholesterol
Cholesterol does not carry any derivatives of glycerol as backbone, and it is found in all animal cell membranes and plays an important role in the regulation of membrane fluidity. Cholesterol has a polar head group which can interact with polar regions, as well as a hydrophobic tail consisting of a series of rings. Cholesterol is also the precursor (starting material) for the synthesis of some steroid hormones, including testosterone and estrogen.

** Amphipathic
Amphipathic refers to a molecule containing both non-polar hydrophobic groups and polar hydrophilic groups.

** Liposome
Liposome is a simple spherical structure with enclosed compartment formed out of a lipid bilayer, allowing the aqueous medium to be present both inside and outside the liposome.

* Macromolecules of life
The macromolecules of life, carbohydrates, nucleic acids, proteins and lipids are all carbon-based molecules that also contain hydrogen and oxygen, and may sometimes contain nitrogen, phosphate or sulfur.
\\

Carbohydrates, nucleic acids and proteins are formed by linking large numbers of subunits called monomers together. Hence, these macromolecules are polymers of specific types of monomers.

** Carbohydrates
Carbohydrates, which include sugars, starch and cellulose, play important roles as sources of energy and as structural components in most cells and organisms. The general formula of carbohydrates is \((CH_2O)_n\), where $n$ is the number of carbon atoms. Do note that the specific formula may differ from the general formula.

*** Monomers
The monomers of carbohydrates are monosaccharides like glucose. The word monosaccharide is derived from the words "mono" (in Greek) meaning single and "saccharum" (in Latin) meaning sugar.

*** Functional role
Carbohydrates are the major energy source for driving the metabolism of living organisms.

*** Structural role
Carbohydrates play important structural roles in forming the cell wall of plants and the exoskeleton of insects.

** Nucleic acids
Nucleic acids are biomolecules that are important for their roles in storage, transfer, and expression of genetic information. There are 2 kinds of nucleic acid, deoxyribonucleic acid (DNA) and ribonucleic acid (RNA). The genetic material of the cell is made of DNA and the information stored in DNA is transmitted via RNA.

*** Monomers
The monomers of nucleic acids are nucleotides like adenosine monophosphate.

*** Functional role
Both DNA and RNA has been found to play important regulatory roles in many cellular functions.

*** Structural role
Nuclei acids rarely serve a structural role at cellular level, but they serve a few important structural roles at organelle level. For example, ribosomal RNA plays a structural role in the ribosome and DNA is an important structural component of nucleosomes and the chromosome.

** Proteins

*** Monomers
The monomers of proteins are amino acids like alanine.

*** Functional role
Proteins have many functional roles. A few examples include:
- Haemoglobin transporting oxygen and carbon dioxide in our circulatory system.
- Antibodies helping to fight diseases, providing immunity.
- Enzymes acting as catalysts in biochemical reactions.
- Hormones helping in homeostasis, which is the regulation of our internal environment.

*** Structural role
Proteins also have many structural roles. A few examples include:
- Collagen found in ligaments, bones, tendons and cartilages help facilitate motion.
- Actin and myosin filaments found in the muscles of animals help form structural support in cells.

** Lipids

*** Components of a lipid
Lipids are not polymers, but most of them are large molecules made up of a number of simpler molecules with common structures. Two components of lipids are glycerol and fatty acids.

*** Functional role
Lipids in adipose cells (fat) act as energy storage while lipids in the brain act as chemical messengers. Many lipids also act as hormones to help in homeostasis and regulation of various biological functions.

*** Structural role
Lipids such as phospholipids are the main structural components of biological membranes.

* Glucose
The glucose ring exists in two forms, $\alpha$ and $\beta$, depending on the position of the hydroxyl group linked to carbon-1. These conformations are labile and hence glucose continuously flips between the $\alpha$ and $\beta$ forms. A solution of glucose is therefore the mixture of the $\alpha$ and $\beta$ forms.

** Isomers of glucose
The two most common isomers of glucose is galactose and fructose. They all have the same molecular formula, but have different structures.

*** Galactose
Galactose and glucose are stereoisomers. The groups on their respective carbone-4 atoms occupy different positions in space.

\newpage

*** Fructose
Glucose and fructose are structural isomers. Unlike the 6-membered ring for glucose, fructose has a 5-membered ring, forming a different structure.
\\

Fructose also exists in $\alpha$ and $\beta$ forms at the carbon-2 position and the conformations are also labile and continuously flip.


* Deoxyribose and ribose
The carbon atoms of the sugar units in deoxyribose and ribose are given the suffix "prime" (represented as '), after the number, to distinguish the numbers given to carbon atoms of the sugar unit from nitrogenous base in a nucleotide structure. So the carbon atoms of deoxyribose and ribose will be denoted as 1', 2', 3', 4', and 5'.

** Difference
Ribose contains a hydroxyl ($OH$) group at the 2' position of the sugar ring while deoxyribose is missing that hydroxyl group.

* Structure of a nucleotide
In a nucleotide, the ribose or deoxyribose unit is linked to:
- A phosphate group through the carbon at the 5' position
- A nitrogenous base through the carbon at the 1' position.

* Nitrogenous bases in nucleic acids

** Purines
Purines have *two* rings in their structures and come in two types, adenine (A), and guanine (G). They are found in both DNA and RNA.

** Pyrimidines
Pyrimidines have a *single* ring in their structures. There are three types of pyrimidines, cytosine (C), which is found in both DNA and RNA, thymine (T), which is only found in DNA, and uracil (U), which only found in RNA.

\newpage

