y1s1/cy1001-cell/macromolecules/notes.org
* The bases and their derivatives
The nucleotide derivatives other than the adenosine derivatives all participate in energy metabolism and are important in biosynthetic processes such as the synthesis of nucleic acids.
\\

Nucleotides such as GTP, cyclic AMP and cyclic GMP are involved in cellular communication.

** Adenine (A)

*** Nucleosides
- Adenosine
- Deoxyadenosine

*** Nucleotides
- Adenosine monophosphate (AMP)
- Adenosine diphosphate (ADP)
- Adenosine triphosphate (ATP)
- Deoxyadenosine monophosphate (dAMP)
- Deoxyadenosine diphosphate (dADP)
- Deoxyadenosine triphosphate (dATP)

Adenosine triphosphate (ATP) is a major energy currency of living organisms, while adenosine diphosphate (ADP) and adenosine monophosphate (AMP) are equally important nucleotides that work along with ATP as principal carries of chemical energy in the cell.

\newpage

** Guanine (G)

*** Nucleosides
- Guanosine
- Deoxyguanosine

*** Nucleotides
- Guanosine monophosphate (GMP)
- Guanosine diphosphate (GDP)
- Guanosine triphosphate (GDP)
- Deoxyguanosine monophosphate (dGMP)
- Deoxyguanosine diphosphate (dGDP)
- Deoxyguanosine triphosphate (dGDP)

** Cytosine (C)

*** Nucleosides
- Cytidine
- Deoxycytidine

*** Nucleotides
- Cytidine monophosphate (CMP)
- Cytidine diphosphate (CDP)
- Cytidine triphosphate (CDP)
- Deoxycytidine monophosphate (dCMP)
- Deoxycytidine diphosphate (dCDP)
- Deoxycytidine triphosphate (dCDP)

  \newpage

** Thymine (T)

*** Nucleosides
- Thymidine or deoxythymidine

*** Nucleotides
- Thymidine monophosphate (TMP) or Deoxythymidine monophosphate (dTMP)
- Thymidine diphosphate (TDP) or Deoxythymidine diphosphate (dTDP)
- Thymidine triphosphate (TDP) or Deoxythymidine triphosphate (dTDP)

Thymidine is only found in DNA. Also, the thymidine derivatives are mentioned without the deoxy- prefix in most text as they only occur in nature in association with deoxyribose, e.g. dTMP as TMP.

** Uracil (U)

*** Nucleosides
- Uridine
- Deoxyuridine

*** Nucleotides
- Uridine monophosphate (UMP)
- Uridine diphosphate (UDP)
- Uridine triphosphate (UDP)
- Deoxyuridine monophosphate (dUMP)
- Deoxyuridine diphosphate (dUDP)
- Deoxyuridine triphosphate (dUDP)

Uridine is only found in RNA. Also, the deoxy- uracil derivatives do not participate in nucleic acid production but are important metabolites.

\newpage

* Phosphodiester bond of nucleic acids
To form nucleic acids, nucleotides are connected one by one through their phosphate groups. Specifically, the 5'-phosphate group of one nucleotide is covalently linked to the 3'\(-OH\) group of the next nucleotide. This bond is called the 3', 5'-phosphodiester bond. Hence, the covalent backbone of DNA (and RNA) consists of alternative deoxyribose (or ribose) and phosphate groups. This is an unchanging feature that runs through the nucleic acid molecule like a backbone, so it is often referred to as the "sugar-phosphate backbone".
\\

DNA and RNA chains are synthesised by enzymes called DNA polymerase and RNA polymerase respectively. The energy required to form a diester bond comes from the energy stored in the bond between the $\alpha$ and $\beta$ phosphates of nucleotide triphosphates. DNA or RNA polymerases catalyse the reaction that joins the $\alpha$ phosphate to the free 3' hydroxyl group at the end of a growing chain.

* Directionality of nucleic acid
in a chain of DNA or RNA, the linkage between one nucleotide and the next is asymmetric, since a phosphate joins the 3' carbon of the sugar in one nucleotide to the 5' carbon of the sugar in the next nucleotide. This allows us to discern the direction of a DNA or RNA chain, which "runs in the 5' to 3' direction". It means that the "first" nucleotide in the nucleic acid chain is the one that has a free 5' carbon, and the "last" nucleotide is the one that has a free 3' carbon. Free in this case refers to the situation whereby the $-OH$ group of that carbon has not been used to form a phosphodiester bond.
\\

The sequence of the four bases (A, G, C and T/U) should be read by following the 5' $\rightarrow$ 3' direction of nucleic acids. We refer to this sequence as the primary structure of nucleic acid.

* Complementary pairing between bases
The bases adenine and thymine (or adenine and uracil in the case of RNA) can pair up opposite each other via two hydrogen bonds. Cytosine and guanine can do likewise via three hydrogen bonds. This is known as complementary pairing.

** Double-stranded DNA
If DNA or RNA are complementary, a double-stranded region can form. DNA is typically double-stranded, with two complementary strands of DNA are paired in opposite directions by the hydrogen bonds between base A of one strand and base T of the other strand, and likewise between bases C and G.
\\

The two strands of double-stranded DNA are in an antiparallel orientation. In other words, the two strands are oriented in opposite directions. Thus, we can find the 5' end of one strand and the 3' end of the other in each piece of double-stranded DNA.
\\

Double-stranded DNA is most commonly found as a right-handed helix, which is called the "B-form". This form makes one complete turn of 360\(\degree\) every 10.5 base pairs, or every 3.5\(\si{nm}\). In this helical state, DNA presents a wider major groove, and a narrower minor groove. Many proteins can interact with specific DNA sequences by accessing the base-pairs through the major or minor grooves.
\\

Since double-stranded DNA is held together by relatively weak hydrogen bonds, we can separate double-stranded DNA into single strands to varying degrees by varying the level of heating. This process is called "DNA-melting". The regions that are rich in A-T will melt first as the A-T base pairs have only two hydrogen bonds and thus are weaker than G-C base pairs which have three.

\newpage

* Amino acid classification
We can classify amino acids based on their properties, which are all different thanks to their various R groups. These properties include:
- Bulkiness
- Polarity
- Hydrophobicity
- Acidity and basicity
- Ability to cross-link
- Ability to form hydrogen bonds
- Aromaticity
- Ionizability

* Parts of a polypeptide
1. Amino (N) terminus
2. Carboxyl (C) terminus
3. Amino acid side groups
4. Peptide backbone

* Protein structure

** Primary structure
The primary structure of a protein is the sequence of amino acids that makes up the polypeptide chain and it is a linear molecule. Since proteins are synthesised from the N to C terminus, the sequences are conventionally written from the N to C terminus. This convention is similar to that of nucleic acid sequences which are read form the 5' to the 3' end according to the direction of sythesis.

** Secondary structures
The linear molecule of the primary structure twists and folds to form secondary structures.

*** \(\alpha\)-helix
The \(\alpha\)-helix is a type of secondary structure which is stabilised by hydrogen bonds between atoms of the backbone of the polypeptide. The amino acid units located 4 amino acids apart are held by hydrogen bonds formed between the \(N-H\) and \(C=O\) groups on the peptide backbone. The \(\alpha\)-helix is represented as a helical ribbon in protein structural diagrams.

