y1s1/cy1001-cell/macromolecules/notes.tex
\section{The bases and their derivatives}
\label{sec:orgcd132a6}
The nucleotide derivatives other than the adenosine derivatives all participate in energy metabolism and are important in biosynthetic processes such as the synthesis of nucleic acids.


Nucleotides such as GTP, cyclic AMP and cyclic GMP are involved in cellular communication.
\subsection{Adenine (A)}
\label{sec:org27a38cc}

\subsubsection{Nucleosides}
\label{sec:org0a5d500}
\begin{itemize}
\item Adenosine
\item Deoxyadenosine
\end{itemize}
\subsubsection{Nucleotides}
\label{sec:org42163e6}
\begin{itemize}
\item Adenosine monophosphate (AMP)
\item Adenosine diphosphate (ADP)
\item Adenosine triphosphate (ATP)
\item Deoxyadenosine monophosphate (dAMP)
\item Deoxyadenosine diphosphate (dADP)
\item Deoxyadenosine triphosphate (dATP)
\end{itemize}

Adenosine triphosphate (ATP) is a major energy currency of living organisms, while adenosine diphosphate (ADP) and adenosine monophosphate (AMP) are equally important nucleotides that work along with ATP as principal carries of chemical energy in the cell.

\newpage
\subsection{Guanine (G)}
\label{sec:org0f7f03a}

\subsubsection{Nucleosides}
\label{sec:org881dd02}
\begin{itemize}
\item Guanosine
\item Deoxyguanosine
\end{itemize}
\subsubsection{Nucleotides}
\label{sec:org67094ec}
\begin{itemize}
\item Guanosine monophosphate (GMP)
\item Guanosine diphosphate (GDP)
\item Guanosine triphosphate (GDP)
\item Deoxyguanosine monophosphate (dGMP)
\item Deoxyguanosine diphosphate (dGDP)
\item Deoxyguanosine triphosphate (dGDP)
\end{itemize}
\subsection{Cytosine (C)}
\label{sec:org0e32941}

\subsubsection{Nucleosides}
\label{sec:orgdbc692e}
\begin{itemize}
\item Cytidine
\item Deoxycytidine
\end{itemize}
\subsubsection{Nucleotides}
\label{sec:orgb4d9287}
\begin{itemize}
\item Cytidine monophosphate (CMP)
\item Cytidine diphosphate (CDP)
\item Cytidine triphosphate (CDP)
\item Deoxycytidine monophosphate (dCMP)
\item Deoxycytidine diphosphate (dCDP)
\item Deoxycytidine triphosphate (dCDP)

\newpage
\end{itemize}
\subsection{Thymine (T)}
\label{sec:orgd24766b}

\subsubsection{Nucleosides}
\label{sec:orged95b06}
\begin{itemize}
\item Thymidine or deoxythymidine
\end{itemize}
\subsubsection{Nucleotides}
\label{sec:org6e4d93e}
\begin{itemize}
\item Thymidine monophosphate (TMP) or Deoxythymidine monophosphate (dTMP)
\item Thymidine diphosphate (TDP) or Deoxythymidine diphosphate (dTDP)
\item Thymidine triphosphate (TDP) or Deoxythymidine triphosphate (dTDP)
\end{itemize}

Thymidine is only found in DNA. Also, the thymidine derivatives are mentioned without the deoxy- prefix in most text as they only occur in nature in association with deoxyribose, e.g. dTMP as TMP.
\subsection{Uracil (U)}
\label{sec:orga5eff03}

\subsubsection{Nucleosides}
\label{sec:org2c5121d}
\begin{itemize}
\item Uridine
\item Deoxyuridine
\end{itemize}
\subsubsection{Nucleotides}
\label{sec:org6a68e9b}
\begin{itemize}
\item Uridine monophosphate (UMP)
\item Uridine diphosphate (UDP)
\item Uridine triphosphate (UDP)
\item Deoxyuridine monophosphate (dUMP)
\item Deoxyuridine diphosphate (dUDP)
\item Deoxyuridine triphosphate (dUDP)
\end{itemize}

Uridine is only found in RNA. Also, the deoxy- uracil derivatives do not participate in nucleic acid production but are important metabolites.

\newpage
\section{Phosphodiester bond of nucleic acids}
\label{sec:org032924b}
To form nucleic acids, nucleotides are connected one by one through their phosphate groups. Specifically, the 5'-phosphate group of one nucleotide is covalently linked to the 3'\(-OH\) group of the next nucleotide. This bond is called the 3', 5'-phosphodiester bond. Hence, the covalent backbone of DNA (and RNA) consists of alternative deoxyribose (or ribose) and phosphate groups. This is an unchanging feature that runs through the nucleic acid molecule like a backbone, so it is often referred to as the "sugar-phosphate backbone".


DNA and RNA chains are synthesised by enzymes called DNA polymerase and RNA polymerase respectively. The energy required to form a diester bond comes from the energy stored in the bond between the \(\alpha\) and \(\beta\) phosphates of nucleotide triphosphates. DNA or RNA polymerases catalyse the reaction that joins the \(\alpha\) phosphate to the free 3' hydroxyl group at the end of a growing chain.
\section{Directionality of nucleic acid}
\label{sec:orgbbc854b}
in a chain of DNA or RNA, the linkage between one nucleotide and the next is asymmetric, since a phosphate joins the 3' carbon of the sugar in one nucleotide to the 5' carbon of the sugar in the next nucleotide. This allows us to discern the direction of a DNA or RNA chain, which "runs in the 5' to 3' direction". It means that the "first" nucleotide in the nucleic acid chain is the one that has a free 5' carbon, and the "last" nucleotide is the one that has a free 3' carbon. Free in this case refers to the situation whereby the \(-OH\) group of that carbon has not been used to form a phosphodiester bond.


The sequence of the four bases (A, G, C and T/U) should be read by following the 5' \(\rightarrow\) 3' direction of nucleic acids. We refer to this sequence as the primary structure of nucleic acid.
\section{Complementary pairing between bases}
\label{sec:org311517f}
The bases adenine and thymine (or adenine and uracil in the case of RNA) can pair up opposite each other via two hydrogen bonds. Cytosine and guanine can do likewise via three hydrogen bonds. This is known as complementary pairing.
\subsection{Double-stranded DNA}
\label{sec:orgd9f1b8d}
If DNA or RNA are complementary, a double-stranded region can form. DNA is typically double-stranded, with two complementary strands of DNA are paired in opposite directions by the hydrogen bonds between base A of one strand and base T of the other strand, and likewise between bases C and G.


The two strands of double-stranded DNA are in an antiparallel orientation. In other words, the two strands are oriented in opposite directions. Thus, we can find the 5' end of one strand and the 3' end of the other in each piece of double-stranded DNA.


Double-stranded DNA is most commonly found as a right-handed helix, which is called the "B-form". This form makes one complete turn of 360\(\degree\) every 10.5 base pairs, or every 3.5\(\si{nm}\). In this helical state, DNA presents a wider major groove, and a narrower minor groove. Many proteins can interact with specific DNA sequences by accessing the base-pairs through the major or minor grooves.


Since double-stranded DNA is held together by relatively weak hydrogen bonds, we can separate double-stranded DNA into single strands to varying degrees by varying the level of heating. This process is called "DNA-melting". The regions that are rich in A-T will melt first as the A-T base pairs have only two hydrogen bonds and thus are weaker than G-C base pairs which have three.

\newpage
\section{Amino acid classification}
\label{sec:org6d1fc74}
We can classify amino acids based on their properties, which are all different thanks to their various R groups. These properties include:
\begin{itemize}
\item Bulkiness
\item Polarity
\item Hydrophobicity
\item Acidity and basicity
\item Ability to cross-link
\item Ability to form hydrogen bonds
\item Aromaticity
\item Ionizability
\end{itemize}
\section{Parts of a polypeptide}
\label{sec:orga741480}
\begin{enumerate}
\item Amino (N) terminus
\item Carboxyl (C) terminus
\item Amino acid side groups
\item Peptide backbone
\end{enumerate}
\section{Protein structure}
\label{sec:org39367ba}

\subsection{Primary structure}
\label{sec:org84f9239}
The primary structure of a protein is the sequence of amino acids that makes up the polypeptide chain and it is a linear molecule. Since proteins are synthesised from the N to C terminus, the sequences are conventionally written from the N to C terminus. This convention is similar to that of nucleic acid sequences which are read form the 5' to the 3' end according to the direction of sythesis.
\subsection{Secondary structures}
\label{sec:orgb7dc0bc}
The linear molecule of the primary structure twists and folds to form secondary structures.
\subsubsection{\(\alpha\)-helix}
\label{sec:org7b1e4c1}
The \(\alpha\)-helix is a type of secondary structure which is stabilised by hydrogen bonds between atoms of the backbone of the polypeptide. The amino acid units located 4 amino acids apart are held by hydrogen bonds formed between the \(N-H\) and \(C=O\) groups on the peptide backbone. The \(\alpha\)-helix is represented as a helical ribbon in protein structural diagrams.
