y1s1/cy1001-cell/macromolecules/notes.org
*** \(\beta\)-pleated sheet (\(\beta\)-sheet)
The \(\beta\)-pleated sheet is formed by the hydrogen bonds between the \(N-H\) and \(C=O\) groups on the peptide backbone. The hydrogen bonds occur between segments of strands lined side by side. A \(\beta\)-pleated sheet can have multiple strands arranged in both parallel and antiparallel fashions. They are often represented as ribbons with arrow heads to indicate the direction of the strands.

** Tertiary structures
The tertiary structure of a protein refers the 3D geometric shape adopted by a single polypeptide chain. We cannot associate regular patterns to units in tertiary structures, so the units are loosely referred to as domains, motifs or modules. Each unit is a clustering of secondary structures in 3D space.

** Quaternary structure
The quaternary structure of a protein refers to the arrangement of multiple polypeptides which give rise to a functional protein complex. Each polypeptide in this case is called a subunit. The subunits can either be identical, or different.

\newpage

* Comparing saturated and unsaturated fatty acids

** Degree of saturation
Saturated fats refer to triglycerides that have only saturated fatty acid chains incorporated while unsaturated fats refer to triglycerides that have varying degrees of unsaturated fatty acid chains incorporated. As long as even one fatty acid chain is unsaturated, it will be classified as an unsaturated fat.

** Molecular structure
Saturated fats are linear as the chains are aligned in a straight manner while unsaturated fats have kinks at the double bonds, which cause the chain to "bend".

** Molecular packing
The linear structure of saturated fats allow the molecules to be regularly and tightly packed while the structure of unsaturated fats makes the packing of molecules irregular and less tight.

** Melting point
The melting point of saturated fats is high due to the compact molecular packing. So fats like butter and lard, which consists of saturated fatty acids, remain solid. However, the melting point of unsaturated fats is low due to the loose molecular packing and hence fats like olive oil, mustard oil, and other vegetable oils which consists of unsaturated fatty acids are often liquids at room temperature.

** Origin
Fats of animal origin are mostly solid or semi-solid due to the high content of saturated fatty acids, while plant oils are often liquid as they contain a high proportion of unsaturated fatty acids. However, palm oil and coconut oil are the two exceptions to plant oils as they contain mostly saturated fatty acids.

* Other lipids
There are many other biological molecules that can be classified under lipids, such as some vitamins such as vitamin A and vitamin D, the plant pigments such as chlorophyll and the carotenoids like \(\beta\)-carotene. These molecules and their variants have many different functions, such as cell-to-cell signalling, biosynthesis and energy processing.

\newpage

* Lipids with amphipathic properties
Although lipids are not soluble, some lipids such as phospholipids, sphingolipids and glycolipids are amphipathic in nature. This means that they contain both non-polar hydrophobic groups and the polar hydrophilic groups. The hydrophobic end tends to stay away from aqueous environments whereas the hydrophilic end tends to seek aqueous environments. This property of amphipathic lipids has made them ideal components to build biological membranes in the aqueous environment of living systems.
\\

To understand the significance of amphipathic molecules, consider soaps and detergents, which are artificially produced amphipathic compounds which are able to emulsify water and oil. The function of emulsification is possible because of the presence of polar hydrophilic groups and non-polar hydrophobic groups on the molecules of soap and detergents. In living systems, however, the function of forming a biological membrane is brought about by the behaviour of amphipathic molecules when they encounter an aqueous environment.
\\

When amphipathic lipids are introduced into the aqueous medium, they form a layer on the water surface and the hydrophilic head groups will interact with water while their hydrophobic fatty acid chains will be sticking up in the air. Hence, if we stir the phospholipids into water, they will organise themselves to form structures with the hydrophilic head groups facing the water medium while the hydrophobic fatty acid chains point away from the water but towards each other. Two common structures that can form spontaneously based on the above conditions are micelles and bilayered spherical compartments or liposomes. This unique property makes amphipathic lipids ideal candidates to build cell membranes which are organised into lipid bi-layer.
\\

The major components used to build the cell membrane are phospholipids, and one can think of the cell to be a greatly extended liposome. We often refer to the biological membrane as the phospholipid-bilayer. Unlike a liposome, a cell membrane does not just consist of amphipathic lipids. It is also embedded with various proteins. In the case of nerve cells, in addition to phospholipids, there is a high concentration of sphingolipids in their membranes.

* Cell membrane and its permeability
The permeability of lipid bilayers to various molecules varies widely from almost impermeable to highly permeable, depending on the charge state, polarity, and size of the molecules. This natural discriminatory property of lipid bilayers has been exploited by nature to regulate the movement of metabolites from one compartment to another, across cell membranes.
